/*Петя любит счастливые числа. Всем известно, что счастливыми являются положительные 
целые числа, в десятичной записи которых содержатся только счастливые цифры 4 и 7. 
Например, числа 47, 744, 4 являются счастливыми, а 5, 17, 467 — не являются.

К сожалению, не все числа счастливые. Петя называет число почти счастливым, 
если количество счастливых цифр в нем — счастливое число. Ему интересно, 
является ли число n почти счастливым.

Входные данные
В единственной строке задано целое число n (1 ≤ n ≤ 10^18).

Пожалуйста, не используйте спецификатор %lld для чтения или записи 64-битных чисел на С++. 
Рекомендуется использовать потоки cin, cout или спецификатор %I64d.

Выходные данные
В единственной строке выведите «YES», если число n — почти счастливое, и «NO» в противном случае (без кавычек).*/


string number = Console.ReadLine();

    int counter = 0;
    foreach (var item in number)
    {
        if (item == '4' || item == '7')
        {
            counter++;
        }
    }
    if (counter == 4 || counter == 7)
    {
        Console.WriteLine("YES");
    }
    else
    {
        Console.WriteLine("NO");
    }